Kolonard/PIC32MZ_HTTP_SERV/Science/main.c
/*
 * Startup and Hardware Configuration
 *
 * Copyright (c) 2016-2019 John Robertson
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 3 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

// RTOS
#include <FreeRTOS.h>
#include <task.h>
#include <queue.h>
#include <semphr.h>
// C Runtime
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
// TCP/IP Stack
#include <FreeRTOS_IP.h>
#include <FreeRTOS_Sockets.h>
#include "FreeRTOS_DHCP.h"

#include "UART2.h"
#include "TestHarness.h"

#if defined(__PIC32MX__)

#define PIC32MX_MAX_FLASH_SPEED     30000000UL

#define CHECON_PREFEN_CACHEABLE     1
#define CHECON_PREFEN_ALL_REGIONS   3
#define CP0_CONFIG_K0_UNCACHED      2
#define CP0_CONFIG_K0_CACHEABLE     3

#endif

#ifndef __MPLAB_DEBUGGER_SIMULATOR
#define UART2_BAUD_RATE     115200UL
#else
#define UART2_BAUD_RATE     460800UL
#endif

#if defined(__32MZ2048EFM144__)
static const uint8_t pIP_ADDRESS[ipIP_ADDRESS_LENGTH_BYTES] = {172, 16, 1, 201};
#else
static const uint8_t pIP_ADDRESS[ipIP_ADDRESS_LENGTH_BYTES] = {192, 168, 1, 101};
#endif

static const uint8_t pNET_MASK[ipIP_ADDRESS_LENGTH_BYTES] = {255, 255, 255, 0};
static const uint8_t pGATEWAY_ADDRESS[ipIP_ADDRESS_LENGTH_BYTES] = {192, 168, 1, 1};
static const uint8_t pDNS_ADDRESS[ipIP_ADDRESS_LENGTH_BYTES] = {192, 168, 1, 1};

static const uint8_t pDEVEL_MAC_ADDR[ipMAC_ADDRESS_LENGTH_BYTES] = {0x02, 'W', 'o', 'o', 'f', '!'};

static void HardwareConfigurePerformance(void);
static void HardwareUseMultiVectoredInterrupts(void);
static void HardwareConfigPeripherals(void);

#if defined(PIC32_HAS_WORKING_TRNG)

extern uint32_t TRNGRead32(void);
extern uint64_t TRNGRead64(void);

#endif

portTASK_FUNCTION_PROTO(Task1, pParams);
portTASK_FUNCTION_PROTO(Task2, pParams);
portTASK_FUNCTION_PROTO(PacketTask, pParams);

TaskHandle_t g_hTask1;
TaskHandle_t g_hTask2;
TaskHandle_t g_hPacketTask;

/*
 *
 */
// HTTP server
#define HTTP_PORT       12312
#define BUFFER_SIZE     1024

// HTTP заголовок и HTML-страница с кнопкой и скриптом для AJAX-запроса
const char http_html_hdr[] = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n";
const char http_index_html[] =
    "<html>"
    "<body>"
    "<h1>Random Number Generator</h1>"
    "<button onclick=\"fetchRandomNumber()\">Generate Random Number</button>"
    "<p id=\"randomNumber\"></p>"
    "<script>"
    "function fetchRandomNumber() {"
    "  fetch('/random').then(response => response.text()).then(data => {"
    "    document.getElementById('randomNumber').innerText = 'Random Number: ' + data;"
    "  });"
    "}"
    "</script>"
    "</body>"
    "</html>";
// Функция обработки HTTP-запроса
void handle_http_request(Socket_t xClientSocket) {
    char buffer[BUFFER_SIZE];
    char response[BUFFER_SIZE];
    uint8_t oo;
    BaseType_t bytesReceived;
    // Получаем HTTP-запрос от клиента
    bytesReceived = FreeRTOS_recv(xClientSocket, buffer, BUFFER_SIZE, 0);
    //
    //__builtin_software_breakpoint();
    if (bytesReceived > 0) {
        oo = 0;
        buffer[bytesReceived] = '\0';  // Завершаем строку
            
        // Проверяем, запрашивает ли клиент главную страницу
        if (strstr(buffer, "GET / ")) {
            // Отправляем главную страницу
            snprintf(response, BUFFER_SIZE, "%s%s", http_html_hdr, http_index_html);
            FreeRTOS_send(xClientSocket, response, strlen(response), 0);
        } else if (strstr(buffer, "GET /random")) {
            // Запрос на случайное число
            int random_number = rand() % 1000;  // Генерация случайного числа
            snprintf(response, BUFFER_SIZE, "%d", random_number);
            FreeRTOS_send(xClientSocket, response, strlen(response), 0);
        } else {
            // Если ресурс не найден, отправляем 404
            snprintf(response, BUFFER_SIZE, "HTTP/1.1 404 Not Found\r\n\r\n");
            FreeRTOS_send(xClientSocket, response, strlen(response), 0);
        }
    }

    // Закрываем соединение с клиентом
    FreeRTOS_closesocket(xClientSocket);
}

// Основная задача HTTP-сервера
void http_server_task(void *pvParameters) {
    Socket_t xListeningSocket, xClientSocket;
    struct freertos_sockaddr xBindAddress, xClientAddress;
    socklen_t xSize = sizeof(xClientAddress);
    TickType_t timeout = pdMS_TO_TICKS(500); // Тайм-аут 500 мс (0.5 секунд)
    char buffer[BUFFER_SIZE];
    char response[BUFFER_SIZE];
    uint8_t oo;
    BaseType_t bytesReceived;
    
    // Создаем сокет для прослушивания входящих соединений
    xListeningSocket = FreeRTOS_socket(FREERTOS_AF_INET, FREERTOS_SOCK_STREAM, FREERTOS_IPPROTO_TCP);
    configASSERT(xListeningSocket != FREERTOS_INVALID_SOCKET);

    // Привязываем сокет к порту HTTP
    xBindAddress.sin_port = FreeRTOS_htons(HTTP_PORT);
    FreeRTOS_bind(xListeningSocket, &xBindAddress, sizeof(xBindAddress));
    
    FreeRTOS_setsockopt(xListeningSocket, 0, FREERTOS_SO_RCVTIMEO, &timeout, sizeof(timeout));
    
    // Начинаем прослушивание порта
    FreeRTOS_listen(xListeningSocket, 5);

    for (;;) {
        // Принимаем входящее соединение
        xClientSocket = FreeRTOS_accept(xListeningSocket, &xClientAddress, &xSize);
        if (xClientSocket != FREERTOS_INVALID_SOCKET) {
            // Обрабатываем запрос и отправляем ответ
            //handle_http_request(xClientSocket);
            // Получаем HTTP-запрос от клиента
            bytesReceived = FreeRTOS_recv(xClientSocket, &buffer, BUFFER_SIZE, 0);
            if (bytesReceived > 0) {
                buffer[bytesReceived] = '\0';  // Завершаем строку

                // Проверяем, запрашивает ли клиент главную страницу
                if (strstr(buffer, "GET / ")) {
                    // Отправляем главную страницу
                    snprintf(response, BUFFER_SIZE, "%s%s", http_html_hdr, http_index_html);
                    FreeRTOS_send(xClientSocket, response, strlen(response), 0);
                } else if (strstr(buffer, "GET /random")) {
                    // Запрос на случайное число
                    int random_number = rand() % 1000;  // Генерация случайного числа
                    snprintf(response, BUFFER_SIZE, "%d", random_number);
                    FreeRTOS_send(xClientSocket, response, strlen(response), 0);
                } else {
                    // Если ресурс не найден, отправляем 404
                    snprintf(response, BUFFER_SIZE, "HTTP/1.1 404 Not Found\r\n\r\n");
                    FreeRTOS_send(xClientSocket, response, strlen(response), 0);
                }
            }

