Kolonard/PIC32MZ_HTTP_SERV/Science/main.c
            // Закрываем соединение с клиентом
            FreeRTOS_closesocket(xClientSocket);
        }
    }
}


int main(int argc, char *argv[])
{
    // Disable interrupts - note taskDISABLE_INTERRUPTS() cannot be used here as
    // FreeRTOS does not globally disable interrupts
    __builtin_disable_interrupts();

    HardwareConfigurePerformance();
    HardwareUseMultiVectoredInterrupts();
    HardwareConfigPeripherals();

    portDISABLE_INTERRUPTS();

    xTaskCreate(&Task1,             "Task1",        350,                            NULL, tskIDLE_PRIORITY + 1, &g_hTask1);
    xTaskCreate(&Task2,             "Task2",        620,                            NULL, tskIDLE_PRIORITY + 1, &g_hTask2);
    xTaskCreate(&PacketTask,        "Packet",       200,                            NULL, tskIDLE_PRIORITY + 4, &g_hPacketTask);
    xTaskCreate(http_server_task,   "HTTP Server",  configMINIMAL_STACK_SIZE * 4,   NULL, tskIDLE_PRIORITY + 1, NULL);
    
#if defined(__PIC32MZ__) && (__PIC32_FEATURE_SET0 == 'D')
    FreeRTOS_IPInit(pIP_ADDRESS, pNET_MASK, pGATEWAY_ADDRESS, pDNS_ADDRESS, pDEVEL_MAC_ADDR);
#else
    uint8_t tMacAddr[ipMAC_ADDRESS_LENGTH_BYTES] = {EMAC1SA2bits.STNADDR1, EMAC1SA2bits.STNADDR2,
                                                    EMAC1SA1bits.STNADDR3, EMAC1SA1bits.STNADDR4,
                                                    EMAC1SA0bits.STNADDR5, EMAC1SA0bits.STNADDR6};

    FreeRTOS_IPInit(pIP_ADDRESS, pNET_MASK, pGATEWAY_ADDRESS, pDNS_ADDRESS, tMacAddr);
#endif
//    FreeRTOS_GetAddressConfiguration(&ulIPAddress, &ulNetMask, &ulGatewayAddress, &ulDNSServerAddress);
    
    
    
    vTaskStartScheduler();
    return EXIT_SUCCESS;
}

/*-----------------------------------------------------------*/

#if defined(__PIC32MZ__)

#if (__PIC32_FEATURE_SET0 == 'E')

void HardwareConfigurePerformance(void)
{
    SYSKEY_UNLOCK();

    // Disable unused peripherals (REFCLKs not disabled due to erratum #5)
    PMD1SET = _PMD1_CVRMD_MASK;
    PMD2SET = _PMD2_CMP1MD_MASK | _PMD2_CMP2MD_MASK;
    PMD3SET = (_PMD3_IC1MD_MASK | _PMD3_IC2MD_MASK | _PMD3_IC3MD_MASK
               | _PMD3_IC4MD_MASK | _PMD3_IC5MD_MASK | _PMD3_IC6MD_MASK
               | _PMD3_IC7MD_MASK | _PMD3_IC8MD_MASK | _PMD3_IC9MD_MASK
               | _PMD3_OC1MD_MASK | _PMD3_OC2MD_MASK | _PMD3_OC3MD_MASK
               | _PMD3_OC4MD_MASK | _PMD3_OC5MD_MASK | _PMD3_OC6MD_MASK
               | _PMD3_OC7MD_MASK | _PMD3_OC8MD_MASK | _PMD3_OC9MD_MASK);
    PMD5SET = (_PMD5_U1MD_MASK | _PMD5_U3MD_MASK | _PMD5_U4MD_MASK
               | _PMD5_U5MD_MASK | _PMD5_U6MD_MASK | _PMD5_SPI1MD_MASK
               | _PMD5_SPI2MD_MASK | _PMD5_SPI3MD_MASK | _PMD5_SPI4MD_MASK
               | _PMD5_SPI5MD_MASK | _PMD5_SPI6MD_MASK | _PMD5_I2C1MD_MASK
               | _PMD5_I2C2MD_MASK | _PMD5_I2C3MD_MASK | _PMD5_I2C5MD_MASK
               | _PMD5_CAN1MD_MASK | _PMD5_CAN2MD_MASK );
    PMD6SET = (_PMD6_RTCCMD_MASK | _PMD6_PMPMD_MASK | _PMD6_EBIMD_MASK);

    // Disable analogue for UART2 pins (B14, G6) and I2C4 pins (G7, G8)
    ANSELBCLR = _ANSELB_ANSB14_MASK;
    ANSELGCLR = _ANSELG_ANSG6_MASK | _ANSELG_ANSG7_MASK | _ANSELG_ANSG8_MASK;

    // PPS and I/O configuration for UART2
    TRISGSET = _TRISG_TRISG6_MASK;
    U2RXRbits.U2RXR = 0b0001;   // RPG6
    RPB14Rbits.RPB14R = 0b0010; // U2TX

    // Disable analogue for Ethernet RMII pins (H4, H5, J8, J9, J11)
    ANSELHCLR = _ANSELH_ANSH4_MASK | _ANSELH_ANSH5_MASK;
    ANSELJCLR = _ANSELJ_ANSJ8_MASK | _ANSELJ_ANSJ9_MASK | _ANSELJ_ANSJ11_MASK;

    // PPS and I/O for Ethernet PHY
    ipconfigPIC32_PHY_CLEAR_HW_RESET();
    TRISHCLR = _TRISH_TRISH11_MASK; // nRST
    TRISCSET = _TRISC_TRISC13_MASK; // nINT
    INT4Rbits.INT4R = 0b0111;       // RPC13

    INTCONCLR = _INTCON_INT4EP_MASK;    // nINT active low so falling edge
    IPC5bits.INT4IP = configKERNEL_INTERRUPT_PRIORITY;

    // I/O configuration for LEDs/switches
    // Note: Erratum #7 on the PIC32MZ EC means that LEDs 1 and 2 won't work
    //       while the Ethernet Controller is enabled
    ANSELBCLR = _ANSELB_ANSB12_MASK | _ANSELB_ANSB13_MASK;  // SW1, SW2
    CNPUBSET = _CNPUB_CNPUB12_MASK | _CNPUB_CNPUB13_MASK | _CNPUB_CNPUB14_MASK;
    ANSELHCLR = _ANSELH_ANSH0_MASK | _ANSELH_ANSH1_MASK;    // LED1, LED2
    TRISHCLR = _TRISH_TRISH0_MASK | _TRISH_TRISH1_MASK | _TRISH_TRISH2_MASK;

    // Configure peripheral busses

    // Set PBCLK2 to deliver 40Mhz clock for PMP/I2C/UART/SPI
    // 200MHz / 5 = 40MHz
    PB2DIVbits.PBDIV = 0b0000100;

    // Timers use clock PBCLK3, set this to 40MHz
    PB3DIVbits.PBDIV = 0b0000100;

    // Ports use PBCLK4, max allowed frequency is 100MHz
    PB4DIVbits.PBDIV = 0b0000001;

    // Set PBCLK5 to 100MHz for Ethernet
    PB5DIVbits.PBDIV = 0b0000001;

    // Enable prefetch module
    PRECONbits.PFMWS = 2;   // 2 wait state
    PRECONbits.PREFEN = 3;  // Enable predictive prefetch for any address

    SYSKEY_LOCK();
}

#elif (__PIC32_FEATURE_SET0 == 'D')

#define QNSEC(f) (((uint16_t) f << 2) | (uint8_t)((f - (int) f) * 4.0f))

typedef struct {
    uint16_t tRFC;
    uint8_t tWR;
    uint8_t tRP;
    uint8_t tRCD;
    uint8_t tRRD;
    uint8_t tWTR;
    uint8_t tRTP;
    uint8_t DLLK;
    uint8_t tRAS;
    uint8_t tRC;
    uint8_t tFAW;
    uint8_t MRD;
    uint8_t XP;
    uint8_t CKE;
    uint8_t RL;
    uint16_t tRFI;
    uint8_t WL;
    uint8_t BL;
} sdram_timing_params_t;

typedef struct {
    uint8_t minlimit;
    uint8_t rqper;
    uint8_t mincmd;
} sdram_arb_params_t;

// FBGA marking: D9SBC == MT47H64M16NF-25E XIT:M
static const sdram_timing_params_t tMT47H64M16NF_25E = {
    QNSEC(127.5f),  // tRFC Idd
    QNSEC(15.0f),   // tWR
    QNSEC(12.5f),   // tRP Idd
    QNSEC(12.5f),   // tRCD Idd
    QNSEC(10.0f),   // tRRD Idd
    QNSEC( 7.5f),   // tWTR
    QNSEC( 7.5f),   // tRTP
    200,            // DLLK
    QNSEC(45.0f),   // tRAS Idd
    QNSEC(57.5f),   // tRC Idd
    QNSEC(45.0f),   // tFAW
    2,              // MRD
    2,              // XP
    3,              // CKE
    5,              // RL/CL Idd
    QNSEC(7800.0f), // tRFI
    4,              // WL
    2               // BL
};

static const sdram_arb_params_t tDDR_ARB_PARAMS[] = {
    {0x1F, 0xFF, 0x04},
    {0x1F, 0xFF, 0x10},
    {0x1F, 0xFF, 0x10},
    {0x04, 0xFF, 0x04},
    {0x04, 0xFF, 0x04}
};

