Kolonard/PIC32MZ_HTTP_SERV/Science/main.c
#define DDR_DRAM_CLK_PERIOD QNSEC(2.5f)
#define DDR_CTRL_CLK_PERIOD (DDR_DRAM_CLK_PERIOD * 2)

#define MPLL_IDIV           3
#define MPLL_MULT           50
#define MPLL_ODIV1          2
#define MPLL_ODIV2          1

// DDR addressing scheme: CS, ROW, BA, COL
#define DDR_CS_BITS         1
#define DDR_ROW_BITS        13
#define DDR_BA_BITS         3
#define DDR_COL_BITS        10

#define QNSEC_DIV(n, d) (((uint16_t)(n) + (d) - QNSEC(1.0f)) / (d))
#define QNSEC_TICKS(q)  (QNSEC_DIV(q, DDR_CTRL_CLK_PERIOD))

typedef enum {
    DRAM_CMD_DSELECT = 0xFFFU,
    DRAM_CMD_PCALL   = 0x401U,
    DRAM_CMD_REF     = 0x801U,
    DRAM_CMD_LDM     = 0x001U
} dram_cmd_t;

#define DRAM_CMD_LDREG(ba)   (DRAM_CMD_LDM | (ba << 12))

#define DRAM_CMD_PCALL_ALL_BANKS    0x0400

typedef enum {
    DRAM_MR_BURST_LEN_POSITION = 0,
    DRAM_MR_BURST_LEN_4        = 0x02 << DRAM_MR_BURST_LEN_POSITION,
    DRAM_MR_BURST_LEN_8        = 0x03 << DRAM_MR_BURST_LEN_POSITION,
    DRAM_MR_BURST_INTERLEAVED  = 1 << 3,
    DRAM_MR_CL_POSITION        = 4,
    DRAM_MR_DLL_RESET          = 1 << 8,
    DRAM_MR_WR_POSITION        = 9,
    DRAM_MR_SLOW_EXIT          = 1 << 12
} dram_mr_t;

typedef enum {
    DRAM_EMR_DLL_DISABLED     = 1 << 0,
    DRAM_EMR_ODS_REDUCED      = 1 << 1,
    DRAM_EMR_CAL_POSITION     = 3,
    DRAM_EMR_TERM_R150        = (0 << 2) | (1 << 6),
    DRAM_EMR_OCD_POSITION     = 7,
    DRAM_EMR_OCD_EXIT         = 0x00 << DRAM_EMR_OCD_POSITION,
    DRAM_EMR_OCD_DEFAULTS     = 0x07 << DRAM_EMR_OCD_POSITION,
    DRAM_EMR_DQS_DISABLE      = 1 << 10,
    DRAM_EMR_RDQS_ENABLE      = 1 << 11,
    DRAM_EMR_OUTPUTS_DISABLED = 1 << 12
} dram_emr_t;

void DRAM_Initialise(const sdram_timing_params_t *p)
{
    uint16_t MR = DRAM_MR_BURST_LEN_8 | (p->RL << DRAM_MR_CL_POSITION)
                  | ((QNSEC_DIV(p->tWR, DDR_DRAM_CLK_PERIOD) - 1) << DRAM_MR_WR_POSITION);
    uint16_t EMR = DRAM_EMR_TERM_R150;

    struct {
        uint16_t cmd;
        uint16_t modeAddr;
        uint16_t timing;
    } tDRAM_INIT_CMDS[] = {
        {DRAM_CMD_DSELECT, 0x0000, QNSEC(400)},

        {DRAM_CMD_PCALL, DRAM_CMD_PCALL_ALL_BANKS, p->tRP + DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_LDREG(2), 0x0000, p->MRD * DDR_DRAM_CLK_PERIOD},
        {DRAM_CMD_LDREG(3), 0x0000, p->MRD * DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_LDREG(1), EMR, p->MRD * DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_LDREG(0), MR | DRAM_MR_DLL_RESET, p->MRD * DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_PCALL, DRAM_CMD_PCALL_ALL_BANKS, p->tRP + DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_REF, 0x0000, p->tRFC},
        {DRAM_CMD_REF, 0x0000, p->tRFC},

        {DRAM_CMD_LDREG(0), MR, p->MRD * DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_LDREG(1), EMR | DRAM_EMR_OCD_DEFAULTS, p->MRD * DDR_DRAM_CLK_PERIOD},

        {DRAM_CMD_LDREG(1), EMR, p->DLLK * DDR_DRAM_CLK_PERIOD}
    };

    volatile uint32_t *pCmd1Array = &DDRCMD10;
    volatile uint32_t *pCmd2Array = &DDRCMD20;

    size_t c;
    for(c = 0; c < _countof(tDRAM_INIT_CMDS); c++)
    {
        uint32_t delay = max(QNSEC_DIV(tDRAM_INIT_CMDS[c].timing, DDR_DRAM_CLK_PERIOD), 2) - 2;
        pCmd1Array[c] = (tDRAM_INIT_CMDS[c].cmd & 0xFFF) | (DRAM_CMD_DSELECT << 12)
                        | ((tDRAM_INIT_CMDS[c].modeAddr & 0xFF) << 24);
        pCmd2Array[c] = (tDRAM_INIT_CMDS[c].modeAddr >> 8)
                        | ((tDRAM_INIT_CMDS[c].cmd & 0x7000) >> 4)
                        | (delay << 11);
    }

    DDRCMDISSUE = (_countof(tDRAM_INIT_CMDS) << _DDRCMDISSUE_NUMHOSTCMDS_POSITION)
                  | _DDRCMDISSUE_VALID_MASK;

    DDRMEMCON = _DDRMEMCON_STINIT_MASK;

    while(DDRCMDISSUE & _DDRCMDISSUE_VALID_MASK);
}

void DDR2_Configure(const sdram_timing_params_t *p)
{
    CFGMPLL &= ~_CFGMPLL_MPLLVREGDIS_MASK;
    while((CFGMPLL & _CFGMPLL_MPLLVREGRDY_MASK) == 0);

    // Configure MPLL
    CFGMPLL &= ~(_CFGMPLL_MPLLIDIV_MASK | _CFGMPLL_MPLLMULT_MASK
                 | _CFGMPLL_MPLLODIV1_MASK | _CFGMPLL_MPLLODIV2_MASK);

    CFGMPLL |= (MPLL_IDIV << _CFGMPLL_MPLLIDIV_POSITION)
                | (MPLL_MULT << _CFGMPLL_MPLLMULT_POSITION)
                | (MPLL_ODIV1 << _CFGMPLL_MPLLODIV1_POSITION)
                | (MPLL_ODIV2 << _CFGMPLL_MPLLODIV2_POSITION);

    CFGMPLL &= ~_CFGMPLL_MPLLDIS_MASK;
    while((CFGMPLL & _CFGMPLL_MPLLRDY_MASK) == 0);

    PMD7CLR = _PMD7_DDR2CMD_MASK;

    // Initialise PHY using recommended settings from DS60001321C
    DDRSCLCFG0 = _DDRSCLCFG0_BURST8_MASK | _DDRSCLCFG0_DDR2_MASK
                 | (p->RL << _DDRSCLCFG0_RCASLAT_POSITION)
                 | _DDRSCLCFG0_ODTCSW_MASK;
    DDRSCLCFG1 = _DDRSCLCFG1_SCLCSEN_MASK
                 | (p->WL << _DDRSCLCFG1_WCASLAT_POSITION);

    DDRPHYPADCON = _DDRPHYPADCON_ODTSEL_MASK | _DDRPHYPADCON_ODTEN_MASK
                   | (2 << _DDRPHYPADCON_ODTPDCAL_POSITION)
                   | (3 << _DDRPHYPADCON_ODTPUCAL_POSITION)
                   | _DDRPHYPADCON_NOEXTDLL_MASK | _DDRPHYPADCON_WRCMDDLY_MASK
                   | _DDRPHYPADCON_HALFRATE_MASK
                   | (14 << _DDRPHYPADCON_DRVSTRNFET_POSITION)
                   | (14 << _DDRPHYPADCON_DRVSTRPFET_POSITION)
                   | _DDRPHYPADCON_RCVREN_MASK
                   | (2 << _DDRPHYPADCON_PREAMBDLY_POSITION);

    DDRSCLLAT = (3 << _DDRSCLLAT_CAPCLKDLY_POSITION)
                | (4 << _DDRSCLLAT_DDRCLKDLY_POSITION);

    DDRPHYDLLR = (0x10 << _DDRPHYDLLR_RECALIBCNT_POSITION)
                 | (0 << _DDRPHYDLLR_DISRECALIB_POSITION)
                 | (3 << _DDRPHYDLLR_DLYSTVAL_POSITION);

    // Initialise the DDR Controller
    DDRMEMWIDTH = _DDRMEMWIDTH_HALFRATE_MASK;

    size_t c;
    for(c = 0; c < _countof(tDDR_ARB_PARAMS); c++)
    {
        DDRTSEL = c * _DDRMINLIM_MINLIMIT_LENGTH;
        DDRMINLIM = tDDR_ARB_PARAMS[c].minlimit;

        DDRTSEL = c * _DDRRQPER_RQPER_LENGTH;
        DDRRQPER = tDDR_ARB_PARAMS[c].rqper;

        DDRTSEL = c * _DDRMINCMD_MINCMD_LENGTH;
        DDRMINCMD = tDDR_ARB_PARAMS[c].mincmd;
    }

    // Column address bits <= 13 so column high mask/position not programmed
    // Only one chip select so chip select mask/position not programmed
    DDRMEMCFG0 = ((DDR_COL_BITS + DDR_BA_BITS) << _DDRMEMCFG0_RWADDR_POSITION)
                 | (DDR_COL_BITS << _DDRMEMCFG0_BNKADDR_POSITION);
    DDRMEMCFG1 = (1 << DDR_ROW_BITS) - 1;
    DDRMEMCFG2 = 0;
    DDRMEMCFG3 = (1 << DDR_COL_BITS) - 1;
    DDRMEMCFG4 = (1 << DDR_BA_BITS) - 1;

    DDRREFCFG = ((QNSEC_TICKS(p->tRFI) - 2) << _DDRREFCFG_REFCNT_POSITION)
                | ((QNSEC_TICKS(p->tRFC) - 2) << _DDRREFCFG_REFDLY_POSITION)
                | (7 << _DDRREFCFG_MAXREFS_POSITION);

