Kolonard/PIC32MZ_HTTP_SERV/Science/main.c
    DDRPWRCFG = (8 << _DDRPWRCFG_PWRDNDLY_POSITION)
                | (17 << _DDRPWRCFG_SLFREFDLY_POSITION);

    uint8_t nxtdatavdly = p->WL;
    uint8_t w2rdly = QNSEC_TICKS(p->tWTR) + p->WL + p->BL;
    uint8_t w2rcsdly = max(w2rdly - 1, 3);
    uint8_t w2pchrgdly = QNSEC_TICKS(p->tWR) + p->WL + p->BL;
    uint16_t slfrefexdly = ((p->DLLK + 1) / 2) - 2;

    DDRDLYCFG0 = ((w2rdly & 0x0F) << _DDRDLYCFG0_W2RDLY_POSITION)
                 | ((w2rcsdly & 0x0F) << _DDRDLYCFG0_W2RCSDLY_POSITION)
                 | ((p->BL - 1) << _DDRDLYCFG0_R2RDLY_POSITION)
                 | (p->BL << _DDRDLYCFG0_R2RCSDLY_POSITION)
                 | ((p->BL - 1) << _DDRDLYCFG0_W2WDLY_POSITION)
                 | ((p->BL - 1) << _DDRDLYCFG0_W2WCSDLY_POSITION)
                 | ((p->BL + 2) << _DDRDLYCFG0_R2WDLY_POSITION)
                 | ((p->RL - p->WL + 3) << _DDRDLYCFG0_RMWDLY_POSITION);
    DDRDLYCFG1 = ((p->CKE - 1) << _DDRDLYCFG1_SLFREFMINDLY_POSITION)
                 | ((slfrefexdly & 0xFF) << _DDRDLYCFG1_SLFREFEXDLY_POSITION)
                 | ((p->CKE - 1) << _DDRDLYCFG1_PWRDNMINDLY_POSITION)
                 | (max(p->XP - 1, p->CKE - 1) << _DDRDLYCFG1_PWRDNEXDLY_POSITION)
                 | ((w2pchrgdly >> _DDRDLYCFG2_W2PCHRGDLY_LENGTH) << _DDRDLYCFG1_W2PCHRGDLY4_POSITION)
                 | ((w2rdly >> _DDRDLYCFG0_W2RDLY_LENGTH) << _DDRDLYCFG1_W2RDLY4_POSITION)
                 | ((w2rcsdly >> _DDRDLYCFG0_W2RCSDLY_LENGTH) << _DDRDLYCFG1_W2RCSDLY4_POSITION)
                 | ((nxtdatavdly >> _DDRXFERCFG_NXTDATAVDLY_LENGTH) << _DDRDLYCFG1_NXTDATAVDLY4_POSITION)
                 | ((slfrefexdly >> 8) << _DDRDLYCFG1_SLFREFEXDLY8_POSITION);
    DDRDLYCFG2 = (QNSEC_TICKS(p->tRP) << _DDRDLYCFG2_PCHRGALLDLY_POSITION)
                 | ((QNSEC_TICKS(p->tRTP) + p->BL - 2) << _DDRDLYCFG2_R2PCHRGDLY_POSITION)
                 | ((w2pchrgdly & 0x0F) << _DDRDLYCFG2_W2PCHRGDLY_POSITION)
                 | ((QNSEC_TICKS(p->tRRD) - 1) << _DDRDLYCFG2_RAS2RASDLY_POSITION)
                 | ((QNSEC_TICKS(p->tRCD) - 1) << _DDRDLYCFG2_RAS2CASDLY_POSITION)
                 | ((QNSEC_TICKS(p->tRP) - 1) << _DDRDLYCFG2_PCHRG2RASDLY_POSITION)
                 | ((p->RL + 3) << _DDRDLYCFG2_RBENDDLY_POSITION);
    DDRDLYCFG3 = ((QNSEC_TICKS(p->tRAS) - 1) << _DDRDLYCFG3_RAS2PCHRGDLY_POSITION)
                 | ((QNSEC_TICKS(p->tRC) - 1) << _DDRDLYCFG3_RAS2RASSBNKDLY_POSITION)
                 | ((QNSEC_TICKS(p->tFAW) - 1) << _DDRDLYCFG3_FAWTDLY_POSITION);

    DDRODTCFG = ((p->RL - 3) << _DDRODTCFG_ODTRDLY_POSITION)
                | ((p->WL - 3) << _DDRODTCFG_ODTWDLY_POSITION)
                | (2 << _DDRODTCFG_ODTRLEN_POSITION)
                | (3 << _DDRODTCFG_ODTWLEN_POSITION);
    DDRODTENCFG = _DDRODTENCFG_ODTWEN_MASK;

    DDRXFERCFG = ((p->WL - 2) << _DDRXFERCFG_NXTDATRQDLY_POSITION)
                 | ((nxtdatavdly & 0x0F) << _DDRXFERCFG_NXTDATAVDLY_POSITION)
                 | ((p->RL - 3) << _DDRXFERCFG_RDATENDLY_POSITION)
                 | (3 << _DDRXFERCFG_MAXBURST_POSITION);

    DRAM_Initialise(p);

    DDRMEMCON = _DDRMEMCON_STINIT_MASK | _DDRMEMCON_INITDN_MASK;

    DDRSCLSTART = _DDRSCLSTART_SCLEN_MASK | _DDRSCLSTART_SCLSTART_MASK;

    while((DDRSCLSTART & _DDRSCLSTART_SCLUBPASS_MASK) == 0);
}

void HardwareConfigurePerformance(void)
{
    SYSKEY_UNLOCK();

    // Disable unused peripherals (REFCLKs not disabled due to erratum #5)
    PMD1SET = _PMD1_CTMUMD_MASK | _PMD1_CVRMD_MASK | _PMD1_LVDMD_MASK;
    PMD2SET = _PMD2_CMP1MD_MASK | _PMD2_CMP2MD_MASK;
    PMD3SET = (_PMD3_IC1MD_MASK | _PMD3_IC2MD_MASK | _PMD3_IC3MD_MASK
               | _PMD3_IC4MD_MASK | _PMD3_IC5MD_MASK | _PMD3_IC6MD_MASK
               | _PMD3_IC7MD_MASK | _PMD3_IC8MD_MASK | _PMD3_IC9MD_MASK
               | _PMD3_OC1MD_MASK | _PMD3_OC2MD_MASK | _PMD3_OC3MD_MASK
               | _PMD3_OC4MD_MASK | _PMD3_OC5MD_MASK | _PMD3_OC6MD_MASK
               | _PMD3_OC7MD_MASK | _PMD3_OC8MD_MASK | _PMD3_OC9MD_MASK);
    PMD5SET = (_PMD5_U1MD_MASK | _PMD5_U3MD_MASK | _PMD5_U4MD_MASK
               | _PMD5_U5MD_MASK | _PMD5_U6MD_MASK | _PMD5_SPI1MD_MASK
               | _PMD5_SPI2MD_MASK | _PMD5_SPI3MD_MASK | _PMD5_SPI4MD_MASK
               | _PMD5_SPI5MD_MASK | _PMD5_SPI6MD_MASK | _PMD5_I2C1MD_MASK
               | _PMD5_I2C2MD_MASK | _PMD5_I2C4MD_MASK | _PMD5_I2C5MD_MASK
               | _PMD5_CAN1MD_MASK | _PMD5_CAN2MD_MASK );
    PMD6SET = (_PMD6_PMPMD_MASK | _PMD6_EBIMD_MASK | _PMD6_GPUMD_MASK
               | _PMD6_GLCDMD_MASK);

    // I/O configuration for UART2 [pins B0, G9] and I2C3 [pins F2, F8]
    ANSELBCLR = _ANSELB_ANSB0_MASK;
    ANSELGCLR = _ANSELG_ANSG9_MASK;

    TRISBSET = _TRISB_TRISB0_MASK;
    U2RXRbits.U2RXR = 0b0101;   // RPB0
    RPG9Rbits.RPG9R = 0b0010;   // U2TX

    // I/O configuration for Ethernet PHY
    ipconfigPIC32_PHY_CLEAR_HW_RESET();
    ANSELBCLR = _ANSELB_ANSB11_MASK;
    TRISJCLR = _TRISJ_TRISJ15_MASK; // nRST
    TRISBSET = _TRISB_TRISB11_MASK; // nINT

    CNCONBSET = _CNCONB_ON_MASK | _CNCONB_EDGEDETECT_MASK;
    CNNEBSET = _CNNEB_CNNEB11_MASK;
    IPC29bits.CNBIP = configKERNEL_INTERRUPT_PRIORITY;

    // I/O configuration for LEDs/switches
    ANSELBCLR = _ANSELB_ANSB12_MASK | _ANSELB_ANSB13_MASK | _ANSELB_ANSB14_MASK;
    TRISHCLR = _TRISH_TRISH0_MASK | _TRISH_TRISH1_MASK | _TRISH_TRISH2_MASK;

    // Configure peripheral busses

    // Set PBCLK2 to deliver 40Mhz clock for PMP/I2C/UART/SPI
    // 200MHz / 5 = 40MHz
    PB2DIVbits.PBDIV = 0b0000100;

    // Timers use clock PBCLK3, set this to 40MHz
    PB3DIVbits.PBDIV = 0b0000100;

    // Ports use PBCLK4, max allowed frequency is 100MHz
    PB4DIVbits.PBDIV = 0b0000001;

    // Set PBCLK5 to 100MHz for Ethernet
    PB5DIVbits.PBDIV = 0b0000001;

    // Enable prefetch module
    PRECONbits.PFMWS = 2;   // 2 wait state
    PRECONbits.PREFEN = 3;  // Enable predictive prefetch for any address

    SYSKEY_LOCK();

    DDR2_Configure(&tMT47H64M16NF_25E);
}

#else

#error Unsupported PIC32MZ class processor

#endif

void HardwareUseMultiVectoredInterrupts(void)
{
    _CP0_BIS_CAUSE(_CP0_CAUSE_IV_MASK);
    INTCONSET = _INTCON_MVEC_MASK;
}

#elif defined(__PIC32MX__)

static void PIC32MXConfigureWaitStates(void)
{
    uint32_t nSystemClock = configCPU_CLOCK_HZ - 1;

