Kolonard/PIC32MZ_HTTP_SERV/Science/main.c
    uint8_t nWaitStates = 0;

    while(nSystemClock > PIC32MX_MAX_FLASH_SPEED)
    {
        nWaitStates++;
        nSystemClock -= PIC32MX_MAX_FLASH_SPEED;
    }

    uint32_t tmp = CHECON & ~(_CHECON_PFMWS_MASK | _CHECON_PREFEN_MASK);

    if(nWaitStates > 0)
    {
        tmp |= (CHECON_PREFEN_ALL_REGIONS << _CHECON_PREFEN_POSITION);
    }

    // Set flash wait states and enabled prefetch for all regions
    CHECON = (tmp | (nWaitStates << _CHECON_PFMWS_POSITION));
}

void HardwareConfigurePerformance(void)
{
    // Set analog pins to digital mode
    AD1PCFG = _AD1PCFG_PCFG_MASK;

    // I/O for Ethernet PHY
    TRISASET = _TRISA_TRISA14_MASK;
    INTCONCLR = _INTCON_INT3EP_MASK;    // nINT active low so falling edge
    IPC3bits.INT3IP = configKERNEL_INTERRUPT_PRIORITY;

    // I/O configuration for LEDs/switches
    CNPUE = _CNPUE_CNPUE15_MASK | _CNPUE_CNPUE16_MASK | _CNPUE_CNPUE19_MASK;
    TRISDCLR = _TRISD_TRISD0_MASK | _TRISD_TRISD1_MASK | _TRISD_TRISD2_MASK;

    // Disable SRAM wait states
    BMXCONCLR = _BMXCON_BMXWSDRM_MASK;

    // Configure flash wait states and prefetch caches
    PIC32MXConfigureWaitStates();

    // Make Kseg0 cacheable
    _bcsc0(_CP0_CONFIG, _CP0_CONFIG_SELECT, _CP0_CONFIG_K0_MASK, CP0_CONFIG_K0_CACHEABLE << _CP0_CONFIG_K0_POSITION);
}

void HardwareUseMultiVectoredInterrupts(void)
{
    extern uint32_t _ebase_address[];

    uint32_t status = _CP0_GET_STATUS();
    status |= _CP0_STATUS_BEV_MASK;
    _CP0_SET_STATUS(status);

    // Setup EBase
    _CP0_SET_EBASE((uintptr_t) _ebase_address);

    // Space vectors by 0x20 bytes
    _CP0_XCH_INTCTL(0x20);

    uint32_t cause = _CP0_GET_CAUSE();
    cause |= _CP0_CAUSE_IV_MASK;
    _CP0_SET_CAUSE(cause);

    status &= ~(_CP0_STATUS_BEV_MASK | _CP0_STATUS_EXL_MASK);
    _CP0_SET_STATUS(status);

    INTCONSET = _INTCON_MVEC_MASK;
}

#else

#error Unsupported processor

#endif

/*-----------------------------------------------------------*/

void HardwareConfigPeripherals(void)
{
#if defined(PIC32_HAS_WORKING_TRNG)
    // Enable TRNG
    RNGCONbits.TRNGEN = 1;

    // Seed the C Runtime pseudo random sequence using the TRNG
    srand( TRNGRead32() );
#endif

#if defined(__PIC32MZ__)
    LATHCLR = _LATH_LATH0_MASK | _LATH_LATH1_MASK | _LATH_LATH2_MASK;
#elif defined(__PIC32MX__)
    LATDCLR = _LATD_LATD0_MASK | _LATD_LATD1_MASK | _LATD_LATD2_MASK;
#endif

    Uart2Initialise(UART2_BAUD_RATE);
}

time_t FreeRTOS_time(time_t *pxTime)
{
    return time(pxTime);
}

BaseType_t xApplicationGetRandomNumber(uint32_t *pulNumber)
{
    *pulNumber = rand();
    return pdTRUE;
}

#if defined(PIC32_HAS_WORKING_TRNG)

uint32_t TRNGRead32(void)
{
#ifndef __MPLAB_DEBUGGER_SIMULATOR
    while(RNGCNTbits.RCNT < 32);
#endif

    return RNGSEED1;
}

uint64_t TRNGRead64(void)
{
#ifndef __MPLAB_DEBUGGER_SIMULATOR
    while(RNGCNTbits.RCNT < 64);
#endif

    return ((uint64_t) RNGSEED2 << 32U) | RNGSEED1;
}

#endif
